NaveenDeepak/Texas-Instruments-F28379D-DRV8305EVM/1ph_HFI_1inverter.c
//#############################################################################
//
// FILE:   empty_driverlib_main.c
//
// TITLE:  Empty Project
//
// Empty Project Example
//
// This example is an empty project setup for Driverlib development.
//
//#############################################################################
// $TI Release: F2837xD Support Library v3.01.00.00 $
// $Release Date: Mon May 22 15:43:40 CDT 2017 $
// $Copyright:
// Copyright (C) 2013-2017 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################

//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include "math.h"

//
// Defines
//
// these are for ADC
#define EX_ADC_RESOLUTION   ADC_RESOLUTION_12BIT    // or ADC_RESOLUTION_16BIT
#define EX_ADC_SIGNAL_MODE  ADC_MODE_SINGLE_ENDED   // or ADC_MODE_DIFFERENTIAL

// these are for generating PWM
#define TB_CLK  DEVICE_SYSCLK_FREQ / 2              // Time base clock is SYCLK / 2
#define PWM_CLK 5000                                // We want to output at 5 kHz

#define PRD_VAL (TB_CLK / (PWM_CLK * 2))            // Calculate period value for up-down count mode

#define EPWM1_TIMER_TBPRD   2000U
#define EPWM1_CMP           1000U

#define EPWM2_TIMER_TBPRD   2000U
#define EPWM2_CMP           1000U

#define EPWM4_TIMER_TBPRD   2000U
#define EPWM4_CMP           1000U

#define DEAD_BAND           50U


// these are for lookup tables
#define CPUFREQ_MHZ           200
#define PI                    3.14159265

//
// GLOBALS
//
float adcResult_Vdd;
float adcResult_A_v_L1;
float adcResult_A_v_L2;
float adcResult_A_i_L1;
float adcResult_A_i_L2;
float adcResult_B_v;
float adcResult_B_i;

uint16_t interruptCount = 0;
uint16_t loopcount = 0;
uint16_t Mainloopcount = 0;
uint16_t EPWM1loopcount = 0;
uint16_t EPWM2loopcount = 0;
uint16_t CMP = 1000U;

// these are for eQEP
uint16_t enc_pos;
uint16_t max_pos = 3999;

// these are for reference currents
float i_aR;
float i_bR;
float i_cR;
float Imag; // = 100;
float Iband = 10;
float phase_offset = 0;   // (-0.59)*PI;  // to rectify encoder offset with respect to phase A

// these are for measured currents
float i_a = 0;
float i_b = 0;
float i_c = 0;

// these are for DAC
float dacVal = 2048;

// these are for HFI
float HFIcount = 0;
float HFIcountmax = 20;
float HFI_duty = 0;
float HFI_dutymag = 200;

//
// PID variables
//

typedef struct
{
    double dState;  // Last position input
    double iState;  // Integrator state
    double iMax, iMin;  // Maximum and minimum allowable integrator state

    double iGain,   // integral gain
           pGain,   // proportional gain
           dGain;   // derivative gain
} SPid;

float errorA = 0;

SPid PidA;
SPid PidB;
SPid PidC;

//
//Function Prototypes
//

// these are for eQEP
void initEQEP(void);

// these are for inverter SPI communication
/*void initSPIAMaster(void);
void configSPIGPIOs(void);
__interrupt void spiaTxFIFOISR(void);
__interrupt void spiaRxFIFOISR(void);
__interrupt void adcA1ISR(void);
__interrupt void adcB1ISR(void);
__interrupt void adcC1ISR(void);*/
// these are for DAC
void configureDAC(void);

//
//Function Prototypes
//
// these are for adc
void initADCs(void);
void initADCSOCs(void);

// these are for EPWM
void initEPWM1(void);
void initEPWM2(void);
//void initEPWM4(void);

__interrupt void epwm1ISR(void);
__interrupt void epwm2ISR(void);
//__interrupt void epwm4ISR(void);


// these are for PID
double UpdatePID(SPid * pid, double error, double position) ;

//
// Main
//
void main(void)
{
    //
    // Initiate device clock and periperals
    //
    Device_init();

    //
    // Disable pin locks and enable internal pullups.u
    //
    Device_initGPIO();

    //
    // Initialize PIE and clear PIE registers. Disables CPU interrupts.
    //
    Interrupt_initModule();

    //
    //Initialize the PIE vector table with pointers to the shell interrupt Interrupt Service Routines (ISR)
    //
    Interrupt_initVectorTable();

    //
    // Initialize GPIOs for use as EQEP1A, EQEP1B, and EQEP1I
    //
    GPIO_setPinConfig(GPIO_20_EQEP1A);
    GPIO_setPadConfig(20, GPIO_PIN_TYPE_STD);

    GPIO_setPinConfig(GPIO_21_EQEP1B);
    GPIO_setPadConfig(21, GPIO_PIN_TYPE_STD);

    GPIO_setPinConfig(GPIO_23_EQEP1I);
    GPIO_setPadConfig(23, GPIO_PIN_TYPE_STD);

    //
    // Configure GPIO0/1, and GPIO2/3 as ePWM1A/1B, ePWM2A/2B
    //
    GPIO_setPadConfig(0, GPIO_PIN_TYPE_STD);
    GPIO_setPinConfig(GPIO_0_EPWM1A);
    GPIO_setPadConfig(1, GPIO_PIN_TYPE_STD);
    GPIO_setPinConfig(GPIO_1_EPWM1B);

    GPIO_setPadConfig(2, GPIO_PIN_TYPE_STD);
    GPIO_setPinConfig(GPIO_2_EPWM2A);
    GPIO_setPadConfig(3, GPIO_PIN_TYPE_STD);
    GPIO_setPinConfig(GPIO_3_EPWM2B);

    //
    // Enable an GPIO output on GPIO124 to clear the ENGATE on booster pack
    //
    GPIO_setPadConfig(124, GPIO_PIN_TYPE_PULLUP);   // Enable pullup on GPIO6
    GPIO_writePin(124, 1);                          // Load output latch
    GPIO_setPinConfig(GPIO_124_GPIO124);              // GPIO124 = GPIO124
    GPIO_setDirectionMode(124, GPIO_DIR_MODE_OUT);  // GPIO124 = output
    DEVICE_DELAY_US(10000);

    //
    // Enable an GPIO output on GPIO26 to clear the ENGATE on booster pack
    //
    GPIO_setPadConfig(26, GPIO_PIN_TYPE_PULLUP);   // Enable pullup on GPIO6
    GPIO_writePin(26, 1);                          // Load output latch
    GPIO_setPinConfig(GPIO_26_GPIO26);              // GPIO124 = GPIO124
    GPIO_setDirectionMode(26, GPIO_DIR_MODE_OUT);  // GPIO124 = output
    DEVICE_DELAY_US(10000);


    //
    // Interrupts that are used in this example are re-mapped to ISR functions
    // found within this file
    //
    /*Interrupt_register(INT_SPIA_TX, &spiaTxFIFOISR);
    Interrupt_register(INT_SPIA_RX, &spiaRxFIFOISR);
    Interrupt_register(INT_ADCA1, &adcA1ISR);
    Interrupt_register(INT_ADCB1, &adcB1ISR);
    Interrupt_register(INT_ADCC1, &adcC1ISR);*/
    Interrupt_register(INT_EPWM1, &epwm1ISR);
    Interrupt_register(INT_EPWM2, &epwm2ISR);
    //Interrupt_register(INT_EPWM4, &epwm4ISR);


    //
    // Set up ADCs
    //
    initADCs();
    //
    // Disable sync(Freeze clock to PWM as well)
    //
    SysCtl_disablePeripheral(SYSCTL_PERIPH_CLK_TBCLKSYNC);
    initEPWM1();
    initEPWM2();
    //initEPWM4();
    //
    // Enable sync and clock to PWM
    //
    SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_TBCLKSYNC);

    //
    // Initializing the SOCs to be triggered by software and ADC interrupts
    initADCSOCs();

    //
    // Setup eQEP1, configuring the unit timer and quadrature capture units
    //
    initEQEP();

    //
    // Configure the DAC module
    //
    configureDAC();

    //
    // Enable interrupts
    //
    Interrupt_enable(INT_EPWM1);
    Interrupt_enable(INT_EPWM2);
    //Interrupt_enable(INT_EPWM4);

