NaveenDeepak/Texas-Instruments-F28379D-DRV8305EVM/1ph_HFI_1inverter.c
    /*Interrupt_enable(INT_ADCA1);
    Interrupt_enable(INT_ADCB1);
    Interrupt_enable(INT_ADCC1);*/

    //
    // Enable Global Interrupt (INTM) and real time interrupt (DBGM)
    //
    EINT ;
    ERTM ;

    //
    // Initialize Pid variables
    //

    PidA.iMax = 1100U;
    PidA.iMin = 900U;
    PidA.pGain = 1U;
    PidA.iGain = 1U;


    // Convert, wait for completion, and store results
    // All the ADC are interrupt initiated SOC. So all the ADC should be software enforced atleast once.
    ADC_forceSOC(ADCA_BASE, ADC_SOC_NUMBER0);   // Vdd
    ADC_forceSOC(ADCA_BASE, ADC_SOC_NUMBER1);   // A_v_L1
    ADC_forceSOC(ADCA_BASE, ADC_SOC_NUMBER2);   // ADC_Imag

    //ADC_forceSOC(ADCA_BASE, ADC_SOC_NUMBER2);   // A_v_L2


    ADC_forceSOC(ADCC_BASE, ADC_SOC_NUMBER0);   // B_v
    ADC_forceSOC(ADCC_BASE, ADC_SOC_NUMBER1);   // A_i_L1
    //ADC_forceSOC(ADCC_BASE, ADC_SOC_NUMBER2);   // A_i_L2

    ADC_forceSOC(ADCB_BASE, ADC_SOC_NUMBER0);   // B_i

    //GPIO_setPadConfig(95, GPIO_PIN_TYPE_STD);
    //GPIO_setDirectionMode(95, GPIO_DIR_MODE_OUT);

    //
    // Loop indefinitely
    //

    //Imag = 0;
    while(1)
    {
        //GPIO_togglePin(95);
        enc_pos = EQEP_getPosition(EQEP1_BASE);
        Imag = (ADC_readResult(ADCARESULT_BASE, ADC_SOC_NUMBER2))/2.0 ;
        dacVal = 2048 + Imag * sin(enc_pos * 2 * PI * 5.0 / max_pos + phase_offset);
        i_aR = Imag * sin(enc_pos * 2 * PI * 5.0 / max_pos + phase_offset );
        i_bR = Imag * sin(enc_pos * 2 * PI * 5.0 / max_pos - 2 * PI / 3 + phase_offset);
        i_cR = Imag * sin(enc_pos * 2 * PI * 5.0 / max_pos + 2 * PI / 3 + phase_offset);
        //SPI_writeDataNonBlocking(SPIB_BASE, sdata);
        //DEVICE_DELAY_US(2);

        //
        // store results
        //

        adcResult_Vdd = ADC_readResult(ADCARESULT_BASE, ADC_SOC_NUMBER0); // Vdd
        adcResult_A_v_L1 = ADC_readResult(ADCARESULT_BASE, ADC_SOC_NUMBER1); // A_v_L1
        //adcResult_A_v_L2 = ADC_readResult(ADCARESULT_BASE, ADC_SOC_NUMBER2); // A_v_L2
        adcResult_B_v = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER0); // B_v
        adcResult_A_i_L1 = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER1); // A_i_L1
        //adcResult_A_i_L2 = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER2); // A_i_L2
        adcResult_B_i = ADC_readResult(ADCBRESULT_BASE, ADC_SOC_NUMBER0); // B_i

        i_a = (adcResult_A_i_L1 - adcResult_B_i); // 1Ampere is represented as 100 units
        errorA = -(i_aR - i_a) ;
        DAC_setShadowValue(DACA_BASE, dacVal);

        /*if(loopcount > 8000)
        {
            //ESTOP0;
        }*/

    }

}
// End of Main Loop


//
// Function to configure eQEP1.
//
void initEQEP(void)
{
    //
    // Configure the decoder for quadrature count mode
    //
    EQEP_setDecoderConfig(EQEP1_BASE, (EQEP_CONFIG_1X_RESOLUTION |
                                       EQEP_CONFIG_QUADRATURE |
                                       EQEP_CONFIG_NO_SWAP));
    EQEP_setEmulationMode(EQEP1_BASE, EQEP_EMULATIONMODE_RUNFREE);

    //
    // Configure the position counter to reset on an maximum position
    //
    EQEP_setPositionCounterConfig(EQEP1_BASE, EQEP_POSITION_RESET_MAX_POS,
                                  max_pos);

    //
    // Enable the eQEP1 module
    //
    EQEP_enableModule(EQEP1_BASE);

    //
    // Configure and enable the edge-capture unit. The capture clock divider is
    // SYSCLKOUT/64. The unit-position event divider is QCLK/32.
    //
    EQEP_setCaptureConfig(EQEP1_BASE, EQEP_CAPTURE_CLK_DIV_64,
                          EQEP_UNIT_POS_EVNT_DIV_32);
    EQEP_enableCapture(EQEP1_BASE);
}
// End of EQEP


// DAC
void configureDAC(void)
{
    //
    // Set VDAC as the DAC reference voltage.
    // Edit here to use ADC VREF as the reference voltage.
    //
    DAC_setReferenceVoltage(DACA_BASE, DAC_REF_ADC_VREFHI);

    //
    // Enable the DAC output
    //
    DAC_enableOutput(DACA_BASE);

    //
    // Set the DAC shadow output to 0
    //
    DAC_setShadowValue(DACA_BASE, 0);

    //
    // Delay for buffered DAC to power up
    //
    DEVICE_DELAY_US(10);
}
// End of configure for DAC


// Initialize ADCs
void initADCs(void)
{
    //
    // Set ADCCLK divider to /4
    //
    ADC_setPrescaler(ADCA_BASE, ADC_CLK_DIV_4_0);
    ADC_setPrescaler(ADCB_BASE, ADC_CLK_DIV_4_0);
    ADC_setPrescaler(ADCC_BASE, ADC_CLK_DIV_4_0);

    //
    // Set resolution and signal mode (see #defines above) and load corresponding trims.
    //
    ADC_setMode(ADCA_BASE, EX_ADC_RESOLUTION, EX_ADC_SIGNAL_MODE);
    ADC_setMode(ADCB_BASE, EX_ADC_RESOLUTION, EX_ADC_SIGNAL_MODE);
    ADC_setMode(ADCC_BASE, EX_ADC_RESOLUTION, EX_ADC_SIGNAL_MODE);

    //
    // Set pulse positions to late
    //
    ADC_setInterruptPulseMode(ADCA_BASE, ADC_PULSE_END_OF_CONV);
    ADC_setInterruptPulseMode(ADCB_BASE, ADC_PULSE_END_OF_CONV);
    ADC_setInterruptPulseMode(ADCC_BASE, ADC_PULSE_END_OF_CONV);

    //
    // Powerup the ADCs and then delay for 1 ms
    //
    ADC_enableConverter(ADCA_BASE);
    ADC_enableConverter(ADCB_BASE);
    ADC_enableConverter(ADCC_BASE);

    DEVICE_DELAY_US(1000);

}


void initADCSOCs(void)
{
    //
    // configure SOCs of ADCA
    // - SOC0 will convert pin A0.
    // - SOC1 will convert pin A1.
    // - Both will be triggered by software only.
    // - For 12-bit resolution, a sampling window of 15 ( 75 ns at a 200MHz SYSCLK rate) will be used.
    // - For 16-bit resolution, a sampling window of 64 (320 ns at a 200MHz SYSCLK rate) will be used.
    //

#if(EX_ADC_RESOLUTION == ADC_RESOLUTION_12BIT)
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER0, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN3, 60);  // Vdd
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER1, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN14, 60);  // A_v_L1
    //ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER2, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN15, 60);  // A_v_L2
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER2, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN1, 60);  // Imag

    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER0, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN3, 60);  // B_v
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER1, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN2, 60);  // A_i_L1
    //ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER2, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN4, 60);  // A_i_L2

    ADC_setupSOC(ADCB_BASE, ADC_SOC_NUMBER0, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN2, 60);  // B_i


#elif(EX_ADC_RESOLUTION == ADC_RESOLUTION_16BIT)
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER0, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN3,64);
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER1, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN14, 64); // A_v
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER0, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN3, 64);// B_v

    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER1, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN2, 64);// A_i
    ADC_setupSOC(ADCB_BASE, ADC_SOC_NUMBER0, ADC_TRIGGER_SW_ONLY, ADC_CH_ADCIN2, 64);// B_i
#endif

    //
    // Set Interrupt1 to trigger ADC SOC in all channels
    //
    ADC_setInterruptSOCTrigger(ADCA_BASE, ADC_SOC_NUMBER0, ADC_INT_SOC_TRIGGER_ADCINT1);  // Vdd
    ADC_setInterruptSOCTrigger(ADCA_BASE, ADC_SOC_NUMBER1, ADC_INT_SOC_TRIGGER_ADCINT1);  // A_v
    ADC_setInterruptSOCTrigger(ADCA_BASE, ADC_SOC_NUMBER2, ADC_INT_SOC_TRIGGER_ADCINT1);  // Imag

    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER0, ADC_INT_SOC_TRIGGER_ADCINT1);  // B_v
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER1, ADC_INT_SOC_TRIGGER_ADCINT1);  // A_i
    //ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER2, ADC_INT_SOC_TRIGGER_ADCINT1);
    ADC_setInterruptSOCTrigger(ADCB_BASE, ADC_SOC_NUMBER0, ADC_INT_SOC_TRIGGER_ADCINT1);  // B_i

    //
    // set SOC1 to set the interrupt 1 flag in A Base.
    // set SOC0 to set the interrupt 1 flag in B Base.
    // set SOC1 to set the interrupt 1 flag in C Base.
    //
    ADC_setInterruptSource(ADCA_BASE, ADC_INT_NUMBER1, ADC_SOC_NUMBER2);
    ADC_setInterruptSource(ADCB_BASE, ADC_INT_NUMBER1, ADC_SOC_NUMBER0);
    ADC_setInterruptSource(ADCC_BASE, ADC_INT_NUMBER1, ADC_SOC_NUMBER1);

    //
    //  Enable the interrupt.
    //
    ADC_enableInterrupt(ADCA_BASE, ADC_INT_NUMBER1);
    ADC_enableInterrupt(ADCB_BASE, ADC_INT_NUMBER1);
    ADC_enableInterrupt(ADCC_BASE, ADC_INT_NUMBER1);

    //
    // Set continuous modes for interrupts
    //

    ADC_enableContinuousMode(ADCA_BASE, ADC_INT_NUMBER1);
    ADC_enableContinuousMode(ADCB_BASE, ADC_INT_NUMBER1);
    ADC_enableContinuousMode(ADCC_BASE, ADC_INT_NUMBER1);

    //
    // make sure its flag is cleared.
    //
    ADC_clearInterruptStatus(ADCA_BASE, ADC_INT_NUMBER1);
    ADC_clearInterruptStatus(ADCB_BASE, ADC_INT_NUMBER1);
    ADC_clearInterruptStatus(ADCC_BASE, ADC_INT_NUMBER1);

